Repository: mozilla-l10n/mt-training-data
Catalog: ydg/ydg_pontoon.tmx
Source language: en_us
Languages: ydg

source: Record yourself responding to questions and prompts in your language
ydg: دے خوئے زبان نے سوالف لے اشارغّف جواب دل محفوظ (ریکارڈ) کن

source: Record your voice
ydg: ڤے خوئے آواز ریکارڈ کن

source: Reference the source of your sentence (required)
ydg: ڤے خوئے جملغف حوالو دل (ضروری)

source: Reject
ydg: مسترد کڑا

source: Remove
ydg: سیتور

source: Remove Avatar
ydg: ڤے ایویٹر ریمو کن

source: Report
ydg: رَپوٹ کن

source: Report was passed successfully
ydg: رپوٹ سے کامیابی منظور ݰوئے

source: Request a Language
ydg: پے یو زبان دیر عرض کن

source: Request for Scripted Speech
ydg: پے نوختیغو گپ دیر درخواست کن

source: Request for Spontaneous Speech
ydg: پے جاری گپ دیر درخواست کن

source: Request New Language
ydg: نوؤ زبانن درخواست کن

source: Request recordings
ydg: نے ریکارڈنگن عرضی کن

source: *required
ydg: ضرورت

source: Re-record
ydg: دیبارو ریکارڈ کن

source: Re-record clip
ydg: ڤے آواز اشپہ ریکارڈ کن

source: Respond
ydg: جواب

source: Response deleted successfully
ydg: جواب سے کامیابی ڈیلیٹ ݰوئے

source: Response submitted successfully
ydg: جواب سے کامیاب جمع ݰوئے

source: Return
ydg: اَشپہ کن

source: Return to Common Voice
ydg: اشپہ دے کامن وائس اَس

source: Return to Common Voice Datasets
ydg: اشپہ دے کامن وائس ڈیٹا سیٹ اَس

source: Return to Languages
ydg: دیبارو میر کو زبانف کرن اَس

source: Review
ydg: دیبارو اوژر

source: Review could not be saved. Please try again later.
ydg: ڤے دیبارو اوݱڑغّو محفوظ کڑا چے ای۔ کیستہ دیبال اڤن کوشش کن

source: ⓘ Review Criteria
ydg: ⓘ دیبارو اوݱڑان معیار

source: Review Criteria
ydg: دیبارو اوݱڑان معیار

source: Reviewed sentences not submitted, are sure?
ydg: اشپہ اوݱڑیغو جملغّے جمع چے ݰوت، تو یقینآ؟

source: Review existing sentences submitted by the community
ydg: دے کمیونٹی ذریعو ڤے جمع کڑغو موجودہ جملغف دیبارو اوژر

source: Reviewing Sentences
ydg: ڤے جملغف دیبارو اوݱڑا

source: Review Questions
ydg: ڤے سوالف دیبارو اوژر

source: Review & re-record clips here as you go
ydg: مولو ڤے چولائی آوازف دیبارو ریکارڈ کن اڤن جائزو غورا

source: Review & re-record clips if needed
ydg: جائزو غورا اڤن کوګ آوازے ریکارڈ کن اگر کہ ضرورت استت

source: Review Sentences
ydg: ڤے جملغّف اوژر

source: Review sentences in your language
ydg: دے خوئے زبان ڤے جملغّف دیبارو اوژر

source: Review & Submit
ydg: دیبارو اوژر تے جمع کن

source: Review transcriptions
ydg: ڤے نوختیغف دیبارو اوژر

source: Review Transcriptions
ydg: ڤے نوختّغف دیبارو اوژر

source: Review transcriptions of recorded sentences for accuracy
ydg: پے درستگی دیر ڤے ریکارڈ ݰوئی جملے غف نقل جائزو غورا۔

source: Review user-submitted transcriptions in your language
ydg: ڤے نوختیغو اشپہ اوژر صارفن کو دے تے جمع کڑے

source: Romanian
ydg: رومانی

source: Romansh Sursilvan
ydg: رومانش سورسیلوان

source: Romansh Vallader
ydg: رونانیش ولادیر

source: Rukai
ydg: روکائے

source: Runyankole
ydg: روننکولے

source: Russian
ydg: رشئین

source: Ruuli
ydg: روولی

source: s
ydg: ایس

source: S
ydg: ایس

source: Sabah Bisaya
ydg: صباح بیسایا

source: Sabah Malay
ydg: صباح مالے

source: Sa'ban
ydg: سابان

source: Sakha
ydg: ساخا

source: Sakizaya
ydg: ساکیزایا

source: Santali (Ol Chiki)
ydg: سانتالی (اوآئی چیکی)

source: Saraiki
ydg: سرائیکی

source: Sardinian
ydg: سارڈینی

source: Save
ydg: محفوظ

source: Saved
ydg: محفوظ کڑغو ݰوئے

source: Scots
ydg: سکوٹس

source: SCRIPTED SPEECH
ydg: نوختیغو گپ

source: Search
ydg: کیستا

source: Search for a language
ydg: یو زبان کوس

source: Search for a language...
ydg: یو زبان کوس...

source: Seediq
ydg: صیدق

source: See Less
ydg: کیستہ اوژر

source: See More
ydg: دیبارو اوژر

source: Select a Language...
ydg: زبان منتخب کن

source: Select an option
ydg: یو طریقو غورا

source: Select a variant (optional)
ydg: یو قسم غورا (اختیاری)

source: Selected
ydg: منتخب کڑ

source: Select File
ydg: فائل منتخب کن

source: Select File to Upload
ydg: اپلوڈ پے کڑان دیر فائل منتخب کن

source: Select the desired language dataset and choose the version you wish to download.
ydg: ڤے خوئے حاجتن زبان نے ڈیٹاسیٹ منتخب کن اڤن ڤے ګیم ورژن کو، کوسیتے ڤؤ ڈاؤن لوڈ کن۔

source: Select up to three domains (optional)
ydg: شروئے ڈومنینزے (اختیاری) منتخب کن

source: Select your age
ydg: ڤے خوئے عمر منتخب کن

source: Select your sex or gender
ydg: ڤے خوئے جنس منتخب کن

source: Self Citation
ydg: ذاتی حوالو

source: Send a link to my email
ydg: دے من ای امیل یو لنک ݰیکور

source: Sentence
ydg: جملو

source: Sentence Collection
ydg: جملغّے بڑیڅڤدا

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
ydg: <sentenceCollectorFragment>پے مزید معلوماتف دیر ڤے جملو جمع کڑغوز اوژر</sentenceCollectorFragment>.

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
ydg: <sentenceCollectorVideo> دے جملو بڑیڅڤدان استعمال باری ڤے ماخ رہنمائی اوژر</sentenceCollectorVideo>.

source: Sentence Domain
ydg: جملو دائرو

source: Sentences
ydg: جملغّے

source: Sentences are collected for people to read aloud.
ydg: آدمے دے زروپ آواز ݱوت رے جملغّے جمع کڑا ایتے۔

source: { $sentences } sentences reviewed. Thank you!
ydg: { $sentences } ڤے جملغّف دیبارو اوݱڑت۔ تو شکریہ!

source: Sentence Variant
ydg: جملغّف مختلف شکل

source: Separate sentences into one line by pressing “Enter” or “Return” once
ydg: یوو دفعہ ڤے "انٹر" یا "ریٹرن" سارو ڤزیب خو دے یو لائن ڤے جملعف الگ کن

source: Serbian
ydg: سربیئن

source: Seri
ydg: سیری

source: Serian Bidayuh
ydg: سیرین بدایوہ

source: Service and Retail
ydg: نوکری اڤن پرچون

source: Set a goal
ydg: یو ہدف واست

source: Setswana
ydg: سٹسوانا

source: Settings
ydg: سیٹنگز/ترتیب

source: Sex
ydg: جنس

source: Sex or Gender
ydg: جنس

source: SHA256 Checksum Copied!
ydg: SHA256 چیکسم کاپی ݰوئے!

source: Shan
ydg: شان

source: Share Common Voice
ydg: ڤے کامن وائس باخݰ (شیئر کن)

source: Share your clip
ydg: ڤے خوئے کوګ آواز باخݰ (شیئر کن)

source: Shilha
ydg: شیہا

source: Shina
ydg: شینا

source: Shortcuts
ydg: کوګ پادو

source: [Should be ‘dinosaurs’]
ydg: [ڈائناسور ݰویا بݰ]

source: Show my ranking
ydg: ڤے من درجو نیݰاݱ

source: Sicilian
ydg: سیسیلیئن

source: Sign up
ydg: سائن آب کن

source: Sign up for an account
ydg: پے اکاؤنٹ دیر سائن آپ کن

source: Sign up for Common Voice newsletters, goal reminders and progress updates
ydg: ڤے کامن وائس نیوز لیٹر، ڤے ہدف پے یاد کڑا دیر اڤن چند ہورغ ݰوئے رے پے معلوماتف دیر سائن آپ کن

source: sign up for email updates
ydg: دے ای میل پے نوؤ گپف دیر سائن آپ کن

source: Sindhi
ydg: سندھی

source: Single
ydg: یو (فګیغو)

source: Single sentence submission
ydg: یو جملو جمع کن

source: Sinhala
ydg: سینہالا

source: Siswati
ydg: سیسواتی

source: Size
ydg: سائز

source: Skip
ydg: لیغان

source: Skipped
ydg: لیغدو

source: Slovak
ydg: سلواک

source: Slovenian
ydg: سلوینیئن

source: Small businesses, including tech and AI start ups
ydg: کوپ کاروبار، کہ آلو ٹیکنالوجی اڤن اے ائی شامل استت شروع کڑا

source: [Sneeze] The giant dinosaurs of the [cough] Triassic.
ydg: [ګرفیا] ٹرائزیکن [خوفیا] استر ڈائناسور

source: Solicit personally identifying information (like names or financial information)
ydg: ڤے ذاتی شناخت معلوماتف کوس (؟مثلا نام اڤن دے پیسو باری معلوماتے )

source: Somali
ydg: سومالی

source: Some languages have enormous variation in grammar, vocabulary and pronunciation. For this reason, we are <ctaLink>introducing ‘Variants’</ctaLink> in 2022. This gives communities a way to distinguish their languages within the larger dataset.
ydg: انیم زبانف گرائمر، جمع شدہ الفاظے، الفاظف ادا کڑان طریقو جاہند دیر۔ دیم وجہ ماخ 2022</ctaLink> قسمن <ctaLink> اوستام۔ مو نے آدمف ڤے خوئے زبان دے استر ڈیٹا سیٹ ژے دیر زبانف فرقڤدان طریقو نݰان دیلتے۔

source: Someone asks for a language to be added.
ydg: کیدی ڤے یو زبان شامل کڑا کیستے۔

source: Something went wrong while fetching audio for transcriptions. Please try again later.
ydg: ڤے آواز نے نوختان میر دے غوردا مسئلو پیدا ݰوئے۔ کیستہ دیبال اڤن کوشش کن۔

source: Something went wrong while fetching prompts. Please try again later.
ydg: ڤے اشارو میر دے غوردا مسئلو پیدا ݰوئے۔ کیستہ دیبال دیبارو کوشش کن۔

source: Soninke
ydg: سونینکے

source: Sorbian, Lower
ydg: سربین، لورئیر

source: Sorbian, Upper
ydg: سربین، اپر

source: Sorry, Common Voice is running slowly. Thanks for your interest.
ydg: معاف کن کامن وائس آرامہ زیغوؤتے۔ پے دلچسپی دیر تو شکریہ۔

source: Sorry, something went wrong
ydg: معافی کوسَمتے، کو څیمی غلط ݰوئے

source: Source: { $sentenceSource }
ydg: ذریعو:{ $sentenceSource }

source: Southern Kurdish
ydg: جنوبی کوردیش

source: Southern Pastaza Quechua
ydg: جنوبی پاستازا کیوچیوا

source: Southern Sotho
ydg: ساوتھرن سوتھو

source: Southwestern Tlaxiaco Mixtec
ydg: جنوب مشرقی ٹیلکسیاکو میکسٹیک

source: Spanish
ydg: سپینش

source: Speak
ydg: گپ دے

source: Speakable
ydg: اݰٹان قابل

source: Speakers
ydg: اݰٹے غوزے

source: Speaking
ydg: گپ ژیا

source: Speaking and Listening
ydg: گپ ژیا اڤن غولیتا

source: Speak now
ydg: وس گپ دے

source: Speak options menu
ydg: ڤے اختیاراتف فہرست ݱا

source: Speak up, contribute here!
ydg: گپ دے، مولو حصو درائے

source: Spelling and Punctuation
ydg: املو اڤن زیر، زبر

source: Splits
ydg: تقسیم

source: Splits (Age and Sex)
ydg: تقسیم(عمر اڤن جنس)

source: SPONTANEOUS SPEECH
ydg: جاری گپ

source: Start recording
ydg: ریکارڈنگ شروع کن

source: Stats
ydg: حساب کتاب

source: Status Page
ydg: ڤے ہورغ اوݱڑان صفحہ

source: Still have questions?
ydg: دیر ام سوالے استتآ؟

source: Submit
ydg: جمع کن

source: Submit All
ydg: ساف جمع کن

source: Submit a new question for the community to read and respond to
ydg: ژے کمیونٹی ممبرانف پے اݰٹا دیر اڤن پے جواب لیا دیر سوال کن

source: Submit a report
ydg: ڤے رپوٹ جمع کن

source: Submit clips
ydg: کوګ آوازے جمع کن

source: Submit new questions for the community to read and respond to
ydg: ژے کمیونٹین ممبرانف پے اݰٹا دیر اڤن پے جواب لیا دیر نوؤ سوال شامل کن

source: Submitted
ydg: جمع ݰوئے

source: Subscribe
ydg: سبسکرائب

source: Success
ydg: کامیاب

source: success checkmark
ydg: کامیابین نݰان

source: Success, profile created!
ydg: سے کامیابی پروفائل ساؤز ݰوئے!

source: Svan
ydg: سوان

source: Swahili
ydg: سواہیلی

source: Swedish
ydg: سویڈیش

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
ydg: ڤے جملغّف پے منظور کڑا دیر سے ہرزوغ کرن سیتور۔ پے مسترد کڑا دیر سے چوپ کرن سیتور۔ پے لیغدا دیر ڤڑغو سیتور۔<strong>ڤے خوئے تبصرو جمع کڑا چے فرموؤا!</strong>

source: Syriac
ydg: سریانی

source: Tagalog
ydg: ٹاگالوگ

source: Tahitian
ydg: تاحیتین

source: Taiwanese (Minnan)
ydg: تائیوانی (منان)

source: Tajik
ydg: تاجک

source: Taking several attempts to read a word.
ydg: ڤے یو لفظ پے اݰٹا دیر جاہند کوشش کڑا۔

source: Tamazight
ydg: تمازیغ

source: Tamil
ydg: تمالی

source: Tap
ydg: ڤزیب

source: Tarifit
ydg: تاریفیت

source: Tatar
ydg: تاتار

source: Technology and Robotics
ydg: ٹیکنالوجی اڤن رابوٹ

source: Technology that speaks your language
ydg: ٹیکنالوجی کو یو دے تے زبان گپ دیہیتے

source: TED-LIUM Corpus
ydg: ٹیڈ- لئیم آوازف مجموعو

source: Teke
ydg: ٹیکے

source: Tell us what you'd like to download:
ydg: نے ماخ گپ دے تو څیمی ڈاؤن لوڈ کڑا کوسیتے؟

source: Telugu
ydg: تیلوگو

source: Tepeuxila Cuicatec
ydg: ٹیپیوزیلا کیوکیٹیک

source: Terms
ydg: شرط

source: <termsLink>Terms</termsLink>
ydg: <termsLink>شرائطے</termsLink>

source: Teutila Cuicatec
ydg: تیوٹیلا کیوکیٹیک

source: Thai
ydg: تھائی

source: Thanks for confirming your account, now let's build your profile.
ydg: ڤے اکاؤنٹ پے تصدیق کڑا دیر تو شکریہ، وس ڤے تے پروفائل سڤزآم

source: Thank you for contributing to Spontaneous Speech!
ydg: دے جاری مشقولگی پے یوانی دیر تو جاہند شکریہ!

source: Thank you for contributing your bulk submission!
ydg: جاہند جملغّے پہ بڑیڅڤدا دیر تو شکریہ!

source: Thank you for contributing your voice!
ydg: ڤے خوئے آواز پے مہربانی کڑا دیر تو شکریہ

source: Thank you for donating your voice clips!
ydg: ڤے خوئے کوګ آوازف پے مہربانی کڑا دیر تو شکریہ

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
ydg: پے ریکارڈنگ دیر تو شکریہ!<lineBreak></lineBreak> وس دیبارو اوژر اڤن ڤے خوئے آوازف تورو جمع کن۔

source: Thank you for your information
ydg: دے آواز معلوماتے پے لیا دیر تو شکریہ۔

source: Thank you for your voice information
ydg: دے آواز معلوماتے پے لیا دیر تو شکریہ

source: Thank you! You’ve sent a new language enquiry
ydg: شکریہ! تو دے یو نوؤ زبان باری سوال ݰیکاڑیت

source: The bumblebee sped by.
ydg: استر مڅھی کورمو ژے تو پیرو نیغوڑ۔

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
ydg: دے آوازف قبرستان وو آوازے استت ګیمے کو نے کامن وائس ڈیٹا سیٹ ادرام شامل چش۔ آوازف قبرستان ام اوکو ڈیٹا سیٹ پے ڈاؤن لوڈ کڑا دیر دستیاب استت۔ ماخ تورو ژیم آدمف و تنظیماتف دیم منصوبو پے حصو غوردا دیر مینادری کینمتے۔

source: The clip has disrespectful or offensive language.
ydg: دے آواز شوم یا غیر مہذب گپ استت

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
ydg: دے کامن وائس ڈیٹا سیٹ ہزار ہا آوازف مثالے شامل استت ژے ین نے سڤزڤدے غوزف ڤے آواز پے ڤزدا دیر اسپاپے تیار کڑا مدد ملاؤ ایتے۔

source: The content contains a language different than I was expecting.
ydg: من څیمی زبانن کو توقع ڤیو مولو موجود زبان ژے ون مختلف۔

source: The content has disrespectful or offensive language.
ydg: تریم ملن غیر مہذب یا شوم گپ استت

source: The giant dino [cough] the Triassic.
ydg: استر دنو ٹرائزیک[خیفتا/خوفیا]

source: The giant dinosaur of the Triassic.
ydg: ٹرائزیکن استر ڈائناسور۔

source: The giant dinosaurs of the Triassi-.
ydg: ٹرائزیکن استر ڈائناسور-.

source: The giant dinosaurs of the Triassic.
ydg: ٹرائزیکن استر ڈائناسور۔

source: The giant dinosaurs of the Triassic. [read by one voice]
ydg: ٹرانزیکن استر ڈائناسور۔ [دے یو آواز ݱا]

source: The giant dinosaurs of the Triassic. Yes.
ydg: ٹرائزیکن استر ڈائناسور۔ ہوٓ/دی

source: The number of recordings and which languages you contribute to will be public.
ydg: چند کہ ریکارڈنگ کڑیت اڤن دے ګیم زبان کہ حصو غوردیت وئے وریع اویت۔

source: The page you are looking for could not be found
ydg: ڤے ګیم صفحہ کو تو کوسیتے وو ملاؤ چے ݰوئے

source: There are currently no prompts for this language. Please refresh the page or try again later.
ydg: فی الحال پئیم زبان دیر چے اشارو چش۔ ڤے صفحہ نوؤ کن یا کیستہ دیبال دیبارو کوشش کن۔

source: There are currently no sentences to review in this language.
ydg: وس دیم زبان پے صحیح کڑا دیر جملغے چش۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ydg: دے یو زبان باری دیشچان جاہند طریقو استت۔ ڤے گپ ڤزدان یو ماڈل پے سڤزڤدا دیر، کامن وائس تر خوئے ملن سے ڤزدان تجویز زور دیلتے یا سیم گپ زور دیلتے کہ یو زبان کڑغوزے کوشش کینت خو ڤئے ڤے یو گپف ڤزانتیآ؟'

source: The recording was too long.
ydg: مو ریکارڈنگ جاہند پے ڤنآغ ڤیو۔

source: The recording was too quiet.
ydg: مو ریکارڈنگ ام خپ ڤیو۔

source: The recording was too short.
ydg: مو ریکارڈنگ جاہند کوګ ڤیو۔

source: The route was unclear.
ydg: راہ پازگو (کلئیر) چے ڤیو

source: The selected file is too large
ydg: منتخب کڑغو فائل جاہند استر استت۔

source: The sentence has a grammatical or spelling error.
ydg: دیم جملو دے گرائمر یا دے املو غلطی استت

source: The sentence has disrespectful or offensive language.
ydg: دے جملو شوم یا غیر مہذب گپ استت۔

source: The sentence must be grammatically correct.
ydg: جملو دے گرائمر لحاظ صحیح اوئے۔

source: The sentence must be speakable.
ydg: جملو اݰٹا قابل فرما۔

source: The sentence must be spelled correctly.
ydg: جملو صحیح نوختیغو اوئے۔

source: The sentence should have fewer than 15 words.
ydg: دے جملو الفاظے ژے 15 کوب ݰویا بݰ

source: The site is ready to be launched when it reaches 75% completion.
ydg: سائٹ ٪75 فیصد مکمل کہ ݰوئے پے شروع کڑا دیر تیار ای

source: The website text is translated into that language.
ydg: ویب سائٹن متن دئے زبان ترجمو ݰوئے

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ydg: تریم موادف ملن ڤے کوئے دے ذاتی طور ڤزدا بݰ معلوماتے استت۔ چیمی کو وف نام، ای میل ایڈریس، ژاغہ، شناختی نمبار یا فون نمبار۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
ydg: ڤیم معلوماتف لیا لازمی نو۔ نتو کہ غیݰے سائیرتے تے شامل کن۔ ماخ کلو کو ڤے ڈیٹاسیٹ نے آدمف دے اپیر آڤرمتے، ماخ ڤے آدمف معلوماتف کوګ کینمتے اڤن ڤیم گپ یقینی کینمتے کہ تے نام اڤن ای میل تو آبادیف معلوماتے مثلاً نام یا جنس لئے لے یوغن جفت چوئی۔ ٹیکنالوجی پے سافف دیر غیݰے پے ہورغ کڑا دیر لے ګیم معلوماتے سڤزڤدے غوزف کو مدد کیتے اورو مختلف آدمف معلوماتے ݰویا بݰ۔ جاہند معلوماتے چی ضروری دیم باری دیر ام ایخسا۔

source: This is how you cite yourself if you wrote the content yourself.
ydg: اگر کہ تو مواد خوو نوختیغت تو دیم قسم ڤے خوئے حوالو دلیتے

source: Three to go!
ydg: شروئے اوزائی!

source: Thur
ydg: تھور

source: Tibetan
ydg: تبتی

source: Tigre
ydg: ٹیگرے

source: Tigrinya
ydg: ٹیگرینیا

source: Tlazoyaltepec Mixtec
ydg: ٹلازویالٹپیک میکس ٹیک

source: Toba Qom
ydg: توبا قوم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
ydg: ڤے خوئے ای میل بادل یا ایڈیٹ پے کڑا دیر، نے ماخ ای میل ݰیکور

source: Today
ydg: در

source: Today's Common Voice progress on clips recorded
ydg: در دے کامن وائس ریکارڈر ݰوئی آوازے

source: Today's Common Voice progress on clips validated
ydg: سے تصدیق ݰیغو آوازف درانے پیش رفت

source: Today's Progress
ydg: درانے ہورغ

source: Toki Pona
ydg: ٹوکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ydg: ڤے کامن وائس دے ڈیٹا سیٹ پے اڤزدا دیر ڤے یو کوګ آواز دے لوہ الگ الگ استعمال کڑغوزف ذریعو تصدیق کڑا بݰ۔

source: Too many files
ydg: جاہند زیات فائلے

source: Top Contributors
ydg: غیݰے ہورغ کڑغوزے

source: Torwali
ydg: توروالی

source: Total
ydg: تمام

source: Total Approved
ydg: تمام منظو ݰیغے

source: Toward next goal
ydg: ڤرو کو نوؤ ہدف

source: Transcribe
ydg: دے نوختا آڤاز

source: Transcribe answers
ydg: ڤے جوابف ترے نوختیغو غواؤ

source: Transcribe Audio
ydg: ڤے آواز دے نوختا لیغان

source: Transcribe audio recordings into text
ydg: ڤے ریکارڈ ݰوئی آواز دے نوختا آڤاز

source: Transcribe audio recordings in your language
ydg: دے خوئے زبان ڤے آواز رکارڈنگف دے نوختا آڤاز

source: Transcript edited successfully
ydg: نوختیغو سے کامیابی سہی کڑغو ݰوئے

source: Transcript submitted successfully
ydg: نوختیغو سے کامیابی جمع (بڑیڅڤدغو) ݰوئے

source: Transcript voted successfully
ydg: نے نوختیغے سے کامیابی ووٹ لیغو ݰوئے

source: Transgender
ydg: مڑ تا ژینگو

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
ydg: <translateVideoLink> ڤے ماخ رہنمائی اوژر کہ ڤے پونتون چیمین استعمال کڑا بݰ۔</translateVideoLink>

source: Translating the site
ydg: ڤے سائٹ ترجمو کڑا

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
ydg: کامن وائس سائٹن ترجملو<strong>دے پونتون</strong>ایتے۔

source: Try again by dragging your file here
ydg: ڤے خوئے فائل مولو لیغان دیبارو کوشش کن

source: Try uploading again
ydg: دیبارو اپلوڈ کڑان کوشش کن

source: Tshivenda
ydg: شیوندا

source: Tunen
ydg: تونین

source: Tupuri
ydg: توپوری

source: Turkish
ydg: ترکش

source: Turkmen
ydg: ترکمانی

source: Tush
ydg: توش

source: Tuvan
ydg: توان

source: Twi
ydg: توی

source: Typically megabytes
ydg: دے عام طور میگا بائٹس

source: Ubykh
ydg: ابیخ

source: Udmurt
ydg: اودمورت

source: Ukrainian
ydg: یوکرینئین

source: Understand contribution criteria
ydg: ڤے حصو غوردان اصول ڤزانا

source: Understand how to contribute and validate on the Common Voice dataset
ydg: ڤزانا دے کامن وائس ڈیٹا سیٹ ڤے جملغف اڤن ڤے کوګ آوازف چیمی کینت جمع کینتے اڤن تصدیق کینتے

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
ydg: ڤیم گپ ڤزانا کہ ڤے آواز دے غولیتا څیمین خیال اوستایا بݰ، اڤن څیمین مدد ڤے آواز ریکارڈنگ بہتر کیتے!

source: Universities, Academics and Researchers
ydg: یونیورسٹی، تعلیمن ماہرینے اڤن محقیقینے

source: Upload aborted. Do you want to delete your recordings?
ydg: آپلود بود ݰوئے۔ ڤے خوئے ریکارڈنگ ڈیلیٹ کینیتیآ؟

source: Upload an image file
ydg: یو نخشو فائل اپلوڈ کن

source: { $uploadedSentences } of { $totalSentences } sentences collected
ydg: { $uploadedSentences } ژے{ $totalSentences } زیات جملغے غورا

source: Upload failed, please retry.
ydg: اپلوڈ چے ݰوئے، براہ مہربانی دیبارو کوشش کن

source: Upload <icon></icon> public domain sentences
ydg: دے عام آدمف دائرو استعمال ݰویا بݰ جملغے اپلوڈ<icon></icon> کن

source: Upload in progress...
ydg: اپلوڈ جاری استت

source: Upload more sentences?
ydg: دیر ام جملغّے اپلوڈ کن؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
ydg: ڤیم آواز دے سرور اپلوڈ کڑا چے ایتے۔ ڤے صفحہ دیبارو لوڈ کن یا کیستہ دیبال کوشش کن۔

source: Upload of this clip keeps failing, keep retrying?
ydg: مو آواز اپلوڈ چے اِیتے۔ دیبارو کوشش کن

source: Urdu
ydg: اردو

source: Use correct grammar
ydg: سہی گرائمر استعمال کن

source: Use correct spelling and grammar
ydg: صحیح املو اڤن گرائمر استعمال کن

source: Use correct spelling and punctuation
ydg: سہی املو اڤن زیر، زبرے استعمال کن

source: User Name
ydg: استعمال کڑغوز نام

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ydg: استعمال کڑغوزے ڤے مہربانی کڑے آوازف صحیح ݰویان تصدیق کینتّے، اوژرتے کہ اݰٹے غوزن ڤے جملے غف صحیح اݰٹے۔

source: Ushojo
ydg: اوشوجو

source: Uyghur
ydg: سوغور

source: Uzbek
ydg: ازبک

source: Validate
ydg: تصدیق کڑا

source: Validated Clips
ydg: تصدیق ݰیغو آوازے

source: Validated Hours
ydg: کل تصدیق شدہ گھنٹائی

source: Validated Hr. Total
ydg: کل۔ تصدیق شدہ ایچ آر

source: Validate readings
ydg: ڤے اݰٹا تصدیق کن

source: Validate Readings
ydg: ڤے اݰٹا تصدیق کن

source: Validate Readings, Review Transcriptions
ydg: ڤے اݰٹا تصدیق کن ڤے نوختے غف اڤن اوژر

source: Validate Readings <small>(Coming soon)</small>
ydg: ڤے اݰٹا تصدیق کن<small>(چوکو ایستے)</small>

source: Validate readings submitted by community members
ydg: ڤے کمیونٹی ممبرانف جمع کڑے اݰٹے غف تصدیق کن

source: Validate user-recorded readings in your language
ydg: دے خوئے زبان ڤے صارفن ریکارڈ کڑغو اݰٹے تصدیق کن

source: Validation Progress
ydg: تصدیقی پیش رفت

source: Value and recognition.
ydg: قدر اڤن قبول کڑا

source: Varying Pronunciations
ydg: لہجہ بادل ژیا

source: Venetian
ydg: وینیٹئین

source: Version
ydg: ورژن

source: Very common mistakes include:
ydg: جاہند عام غلطی

source: Vietnamese
ydg: ویتنامی

source: Visible
ydg: ترے چام آغویا بݰ

source: Voice clips are entered into a submission queue that readies them for listening.
ydg: ڤے کوګ آوازف دے یو ژر اوستیان آلو یئے پے غولیتا دیر تیار اویتے۔

source: Voice Collection
ydg: آواز بڑیڅڤدا

source: Voice Contribution
ydg: ڤے آواز مہربانی کڑا

source: Voice Dataset, Ready for Download
ydg: آوازف ڈیٹاسیٹ پے ڈاؤن لوڈ دیر تیار استت

source: Voices Online Now
ydg: آوازے وس آنلائن ݰوت

source: Voice Validation
ydg: ڤے آواز تصدیق کڑا

source: Volume
ydg: آواز

source: Votic
ydg: وٹیک

source: Wakhi
ydg: وخی
